'use strict';

// function func([...employee]) {
// 	let name       = employee[0];
// 	let surname    = employee[1];
// 	let department = employee[2];
// 	let position   = employee[3];
// 	let salary     = employee[4];
//     console.log(employee);
//     // if (...employee) or (...[...employee])
//     // 0: (5) ['Иван', 'Иванов', 'отдел разработки', 'программист', 2000]
//     // if ([...employee])
//     // (5) ['Иван', 'Иванов', 'отдел разработки', 'программист', 2000]

// }

// func( ['Иван', 'Иванов', 'отдел разработки', 'программист', 2000] );


// ======================  Destructuring  =========================
// ======================  JSON  =========================
// ======================  Object.entries+  =========================
// ======================  Iterables =========================
// ======================  Array methods =========================


